tutorial/DAInverse_tutorials/junction-DA/junction_base/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 6e-06;

boundaryField
{
    farField
    {
        type            slip;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 6e-06;
    }
    outlet
    {
        type            zeroGradient;
    }
    symm
    {
        type            symmetryPlane;
    }
    wall
    {
        type            kqRWallFunction;
        value           uniform 6e-06;
    }
    wing
    {
        type            kqRWallFunction;
        value           uniform 6e-06;
    }
}


// ************************************************************************* //
