tutorial/DAInverse_tutorials/junction-DA/junction_base/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.001;

boundaryField
{
    farField
    {
        type            slip;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 0.001;
    }
    outlet
    {
        type            zeroGradient;
    }
    symm
    {
        type            symmetryPlane;
    }
    wall
    {
        type            omegaWallFunction;
        value           uniform 0.001;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        beta1           0.075;
    }
    wing
    {
        type            omegaWallFunction;
        value           uniform 0.001;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        beta1           0.075;
    }
}


// ************************************************************************* //
