tutorial/DAInverse_tutorials/junction-DA/junction_base/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        //solver          GAMG;
        //tolerance       1e-05;
        //relTol          0.1;
        //minIter         5;
        //maxIter         100;
        //smoother        GaussSeidel;
        //nPreSweeps      1;
        //nPostSweeps     3;
        //nFinestSweeps     3;
        //scaleCorrection     true;
        //directSolverCoarest     false;
        //cacheAgglomeration true;
        //nCellsInCoarsestLevel 50;
        //agglomerator    faceAreaPair;
        //mergeLevels     1;
        solver          PCG;
        preconditioner  FDIC;
        tolerance       1e-6;
        relTol          0.1;
    }

    "(U|k|omega|epsilon)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-10;
        relTol          0.01;
    }

    //U
    //{
    //    solver          smoothSolver;
    //    smoother        GaussSeidel;
    //    nSweeps         2;
    //    tolerance       1e-08;
    //    relTol          0.1;
    //}

    //nuTilda
    //{
    //    solver          smoothSolver;
    //    smoother        GaussSeidel;
    //    nSweeps         2;
    //    tolerance       1e-08;
    //    relTol          0.1;
    //}
    //k
    //{
    //    solver          smoothSolver;
    //    smoother        GaussSeidel;
    //    nSweeps         2;
    //    tolerance       1e-08;
    //    relTol          0.1;
    //}
    //omega
    //{
    //    solver          smoothSolver;
    //    smoother        GaussSeidel;
    //    nSweeps         2;
    //    tolerance       1e-08;
    //    relTol          0.1;
    //}
    //epsilon
    //{
    //    solver          smoothSolver;
    //    smoother        GaussSeidel;
    //    nSweeps         2;
    //    tolerance       1e-08;
    //    relTol          0.1;
    //}
}

SIMPLE
{
    nNonOrthogonalCorrectors 1;
    //pRefCell        0;
    //pRefValue       0;
}

PISO
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}

relaxationFactors
{
    fields
    {
        p               0.3;
    }
    equations
    {
        U               0.7;
        nuTilda         0.7;
        k               0.7;
        omega           0.7;
        epsilon           0.7;
    }
}


// ************************************************************************* //
